# DuctFittingAndAccessoryPressureDropData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropData Methods
DuctFittingAndAccessoryPressureDropData Class See Also
---
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDuctFittingAndAccessoryData | Returns the fitting and accessory information. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPresureDropItems | Returns the pressure drop items. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetDefaultEntity | Stores the default entity in the data. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace